:PROPERTIES:
:ID:       b1c97a0f-f48e-4050-a5e2-59914337e813
:header-args:ein-julia: :session http://127.0.0.1:8888/julia.ipynb
:END:
#+title: Julia Eval



#+begin_src emacs-lisp :tangle yes
 (shell-command-to-string
  (format "2>/dev/null jupyterEnv kernelspec list --json"))
#+end_src

#+RESULTS:
#+begin_example
{
  "kernelspecs": {
    "python-with-threat-intelligence": {
      "resource_dir": "/nix/store/iljfh96kb6rbaf71cf58vn1khj4rqc4d-python-with-threat-intelligence-jupyter-kernel/kernels/python-with-threat-intelligence",
      "spec": {
        "argv": [
          "/nix/store/birm2bkm37nii92d1wh1ypi1qrkz6sqi-wrapper-python3-3.10.8-env/bin/python",
          "-m",
          "ipykernel_launcher",
          "-f",
          "{connection_file}"
        ],
        "env": {},
        "display_name": "python with threat intelligence",
        "language": "python",
        "interrupt_mode": "signal",
        "metadata": {}
      }
    },
    "julia": {
      "resource_dir": "/nix/store/yp1zrhd8ih5wmfg2j0frg42pgh32la4x-julia-jupyter-kernel/kernels/julia",
      "spec": {
        "argv": [
          "/nix/store/b18afjp6ykm3c7lsmsn49qw45rdaiaqq-wrapper-julia-1.8.3/bin/julia",
          "-L",
          "/nix/store/ycy5jkg5mgpm2nl3sdl2hf25b8na8c7a-startup.jl",
          "-i",
          "--startup-file=yes",
          "--color=yes",
          "~/.julia/packages/IJulia/AQu2H/src/kernel.jl",
          "{connection_file}"
        ],
        "env": {},
        "display_name": "julia kernel",
        "language": "julia",
        "interrupt_mode": "signal",
        "metadata": {}
      }
    },
    "bash": {
      "resource_dir": "/nix/store/3d7gwmcczysf2n7rbg9hbc69q9hn9xj5-bash-jupyter-kernel/kernels/bash",
      "spec": {
        "argv": [
          "/nix/store/42gdpr7002pvx9lh1ssf6sw1rvml5434-wrapper-python3-3.10.8-env/bin/python",
          "-m",
          "bash_kernel",
          "-f",
          "{connection_file}"
        ],
        "env": {},
        "display_name": "bash kernel",
        "language": "bash",
        "interrupt_mode": "signal",
        "metadata": {}
      }
    },
    "python3": {
      "resource_dir": "/nix/store/511lg09fzmp1clg8n7kja8ci2cxj3z95-python3-3.10.8-env/share/jupyter/kernels/python3",
      "spec": {
        "argv": [
          "python",
          "-m",
          "ipykernel_launcher",
          "-f",
          "{connection_file}"
        ],
        "env": {},
        "display_name": "Python 3 (ipykernel)",
        "language": "python",
        "interrupt_mode": "signal",
        "metadata": {
          "debugger": true
        }
      }
    }
  }
}
#+end_example


#+begin_src ein

#+end_src

#+NAME: c0278b0c-ed87-4209-b564-e03a4fa210ef
#+begin_src ein-julia :exports both :results ouput
using Dates
format = DateFormat("yyyymmdd")
#+end_src

#+RESULTS: c0278b0c-ed87-4209-b564-e03a4fa210ef
: yyyymmdd


#+NAME: f290df64-2617-4368-941f-f953b7080217
 #+begin_src ein-julia :exports both :results ouput
 Date("19870913", format)
 #+end_src

 #+RESULTS: f290df64-2617-4368-941f-f953b7080217
 : 1987-09-13
